[
  {
    "title": "To Kill a Mockingbird",
    "author": ["Harper Lee"],
    "publishedYear": 1960,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/To_Kill_a_Mockingbird_%28first_edition_cover%29.jpg/500px-To_Kill_a_Mockingbird_%28first_edition_cover%29.jpg",
    "rating": 4.8,
    "mrp": 499,
    "price": 326,
    "pages": 281,
    "summary": "A deeply moving novel set in the racially segregated American South, narrated through the innocent eyes of young Scout Finch. The story follows her father, Atticus, as he defends a Black man falsely accused of a grave crime. Through powerful scenes of injustice, courage, and empathy, Scout learns about morality and human complexity. The book remains a timeless exploration of conscience, compassion, and the fight for equality."
  },
  {
    "title": "The Great Gatsby",
    "author": ["F. Scott Fitzgerald"],
    "publishedYear": 1925,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg/800px-The_Great_Gatsby_Cover_1925_Retouched.jpg",
    "rating": 4.4,
    "mrp": 199,
    "price": 147,
    "pages": 218,
    "summary": "Set in the glittering Jazz Age, the novel follows Nick Carraway’s encounter with the enigmatic millionaire Jay Gatsby, whose life is shaped by an obsessive love for Daisy Buchanan. Beneath the glamour and wealth lies a hollow world driven by illusions and ambition. Through tragedy and betrayal, the story exposes the fragility of dreams and the darker side of the American Dream. A haunting, lyrical portrait of longing and disillusionment."
  },
  {
    "title": "1984",
    "author": ["George Orwell"],
    "publishedYear": 1949,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/51/1984_first_edition_cover.jpg",
    "rating": 4.7,
    "mrp": 399,
    "price": 219,
    "pages": 328,
    "summary": "A chilling dystopian classic depicting a future where a totalitarian regime monitors every thought and action. Winston Smith, a low-ranking worker, begins questioning the oppressive system built on propaganda and fear. As he secretly seeks truth and freedom, he faces betrayal, manipulation, and psychological control. The novel remains a powerful warning about surveillance, authoritarianism, and the distortion of reality."
  },
  {
    "title": "The Alchemist",
    "author": ["Paulo Coelho"],
    "publishedYear": 1988,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/c4/TheAlchemist.jpg",
    "rating": 4.3,
    "mrp": 399,
    "price": 238,
    "pages": 208,
    "summary": "A poetic and philosophical fable following Santiago, a shepherd who embarks on a journey to find a hidden treasure. Along the way, he meets mentors, faces trials, and learns to listen to the omens of the universe. His quest becomes a metaphor for discovering one’s purpose and trusting the path of destiny. The story inspires readers to chase their dreams with courage and faith."
  },
  {
    "title": "The Catcher in the Rye",
    "author": ["J. D. Salinger"],
    "publishedYear": 1951,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/The_Catcher_in_the_Rye_%281951%2C_first_edition_cover%29.jpg/800px-The_Catcher_in_the_Rye_%281951%2C_first_edition_cover%29.jpg",
    "rating": 4.0,
    "mrp": 450,
    "price": 320,
    "pages": 214,
    "summary": "Told through the raw, honest voice of teenager Holden Caulfield, the novel explores alienation, confusion, and the struggle to find authenticity in a “phony” world. After being expelled from school, Holden wanders New York City searching for connection and meaning. His reflections reveal deep emotional conflict, vulnerability, and a longing to protect innocence. A defining work on adolescence and identity."
  },
  {
    "title": "The Kite Runner",
    "author": ["Khaled Hosseini"],
    "publishedYear": 2003,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/6/62/Kite_runner.jpg",
    "rating": 4.6,
    "mrp": 599,
    "price": 368,
    "pages": 371,
    "summary": "Set in Afghanistan and later America, the novel follows Amir, a privileged boy, and his loyal friend Hassan, whose bond is shattered by betrayal. As political turmoil engulfs their homeland, Amir grapples with guilt, identity, and the heavy burden of redemption. Years later, he is given a chance to confront his past and seek forgiveness. A deeply emotional story about friendship, sacrifice, and the lifelong scars of shame and courage."
  },
  {
    "title": "The Book Thief",
    "author": ["Markus Zusak"],
    "publishedYear": 2005,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/8/8f/The_Book_Thief_by_Markus_Zusak_book_cover.jpg",
    "rating": 4.6,
    "mrp": 499,
    "price": 326,
    "pages": 552,
    "summary": "Set in Nazi Germany and narrated by Death, the novel follows Liesel Meminger, a young girl who discovers the transformative power of books. As she steals stories to escape the horrors around her, she forms deep bonds with her foster family and a hidden Jewish man. Through moments of beauty and tragedy, the story explores humanity, resilience, and the role of words during dark times. A haunting yet hopeful reflection on love and loss."
  },
  {
    "title": "The Fault in Our Stars",
    "author": ["John Green"],
    "publishedYear": 2012,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a9/The_Fault_in_Our_Stars.jpg",
    "rating": 4.2,
    "mrp": 450,
    "price": 323,
    "pages": 313,
    "summary": "Hazel Grace Lancaster, a teen living with cancer, meets Augustus Waters in a support group, sparking an extraordinary love story. Together, they navigate illness, dreams, humor, and heartbreak with honesty and wit. Their journey challenges how we view life, suffering, and meaning. Poignant and emotional, the novel celebrates love’s power even in the shadow of mortality."
  },
  {
    "title": "Animal Farm",
    "author": ["George Orwell"],
    "publishedYear": 1945,
    "category": "Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Animal_Farm_-_1st_edition.jpg/500px-Animal_Farm_-_1st_edition.jpg",
    "rating": 4.5,
    "mrp": 149,
    "price": 99,
    "pages": 112,
    "summary": "A sharp political allegory where farm animals overthrow their human oppressor, hoping to build a fair and equal society. But as the pigs seize power, the revolution descends into tyranny and lies. Orwell exposes how corruption, propaganda, and ambition can distort even idealistic movements. A timeless critique of totalitarianism and human nature."
  },
  {
    "title": "The Hunger Games",
    "author": ["Suzanne Collins"],
    "publishedYear": 2008,
    "category": "Fiction",
    "imageUrl": "https://covers.shakespeareandcompany.com/97814071/9781407132082.jpg",
    "rating": 4.5,
    "mrp": 650,
    "price": 550,
    "pages": 374,
    "summary": "In a dystopian future, Katniss Everdeen volunteers in place of her sister to participate in a brutal televised fight to the death. Navigating alliances, survival, and political manipulation, she becomes a symbol of rebellion against the oppressive Capitol. The story blends action with powerful themes of inequality, sacrifice, and resilience. A gripping tale of courage against a corrupt system."
  },

  {
    "title": "Sapiens",
    "author": ["Yuval Noah Harari"],
    "publishedYear": 2011,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Sapiens-_A_Brief_History_of_Humankind.png/330px-Sapiens-_A_Brief_History_of_Humankind.png",
    "rating": 4.5,
    "mrp": 699,
    "price": 480,
    "pages": 464,
    "summary": "A sweeping exploration of human history, tracing how Homo sapiens rose to dominate the planet. Harari weaves insights from biology, anthropology, and economics to show how shared myths, cooperation, and technology shaped societies. The book challenges readers to rethink their understanding of culture, religion, and progress. A bold and provocative look at our past and future."
  },
  {
    "title": "Atomic Habits",
    "author": ["James Clear"],
    "publishedYear": 2018,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/2/28/Atomic_Habits_book_cover.jpg",
    "rating": 4.7,
    "mrp": 899,
    "price": 535,
    "pages": 320,
    "summary": "James Clear presents a practical framework for transforming habits through small, consistent improvements. He explains how identity, environment, and systems shape behavior far more than motivation alone. With actionable strategies and real-life examples, the book teaches how to break bad habits and build powerful new ones. A guide to compounding tiny changes into remarkable results."
  },
  {
    "title": "Educated",
    "author": ["Tara Westover"],
    "publishedYear": 2018,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/1/1f/Educated_%28Tara_Westover%29.png",
    "rating": 4.6,
    "mrp": 699,
    "price": 419,
    "pages": 334,
    "summary": "Tara Westover grows up in a strict, survivalist family with no formal schooling, medical care, or freedom. Determined to learn, she teaches herself enough to enter university, beginning a journey that reshapes her identity. Her memoir grapples with trauma, loyalty, and the painful cost of independence. A powerful testament to the life-changing force of education."
  },
  {
    "title": "A Brief History of Time",
    "author": ["Stephen Hawking"],
    "publishedYear": 1988,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a3/BriefHistoryTime.jpg",
    "rating": 4.2,
    "mrp": 499,
    "price": 326,
    "pages": 212,
    "summary": "Stephen Hawking takes readers on a journey through the mysteries of the universe, from black holes and relativity to the Big Bang. Written for a general audience, the book breaks down complex scientific concepts with clarity and curiosity. It invites readers to ponder the origins of the cosmos, the nature of time, and the limits of human understanding. A landmark work in popular science."
  },
  {
    "title": "Storyworthy",
    "author": ["Matthew Dicks"],
    "publishedYear": 2018,
    "category": "Non-Fiction",
    "imageUrl": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1514780933i/37786022.jpg",
    "rating": 4.1,
    "mrp": 999,
    "price": 699,
    "pages": 368,
    "summary": "Matthew Dicks helps readers find and shape compelling personal stories hidden in everyday life. Through exercises like “Homework for Life,” he teaches how to recognize meaningful moments and turn them into engaging narratives. The book blends humor, technique, and personal experience to improve storytelling skills. A practical guide for anyone wanting to communicate with impact."
  },
  {
    "title": "Outliers",
    "author": ["Malcolm Gladwell"],
    "publishedYear": 2008,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/e/ec/Outliers_%28book_cover%29.png",
    "rating": 4.1,
    "mrp": 445,
    "price": 250,
    "pages": 309,
    "summary": "Gladwell explores the hidden factors behind extraordinary success, arguing that culture, opportunity, and timing matter more than raw talent. Through famous case studies, he examines themes like the “10,000-hour rule,” family upbringing, and societal advantages. The book encourages readers to rethink how success is shaped and why some individuals rise above the rest. Insightful and eye-opening."
  },
  {
    "title": "Quiet",
    "author": ["Susan Cain"],
    "publishedYear": 2012,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/1/1e/QuietBookCover.jpg",
    "rating": 4.2,
    "mrp": 599,
    "price": 419,
    "pages": 352,
    "summary": "Susan Cain explores the undervalued strengths of introverts in a society that often glorifies extroversion. Through scientific research and real-life stories, she reveals how introverts contribute deeply in creativity, leadership, and problem-solving. The book encourages embracing different temperaments and rethinking workplace, education, and relationships. A powerful celebration of quiet power."
  },
  {
    "title": "Factfulness",
    "author": ["Hans Rosling"],
    "publishedYear": 2018,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/b/b2/Factfulness_Ten_Reasons_We%27re_Wrong_About_the_World--and_Why_Things_Are_Better_Than_You_Think.jpg",
    "rating": 4.5,
    "mrp": 599,
    "price": 361,
    "pages": 352,
    "summary": "A data-driven book that challenges common misconceptions and paints an optimistic picture of global progress. Hans Rosling debunks widespread misconceptions about global progress using data and clear reasoning. He shows how fear, media bias, and outdated assumptions distort our view of the world. With engaging examples, he encourages adopting a fact-based mindset that leads to clarity and optimism. An eye-opening guide to understanding reality more accurately."
  },
  {
    "title": "Why We Sleep",
    "author": ["Matthew Walker"],
    "publishedYear": 2017,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/94/Why_We_Sleep_book_cover.png",
    "rating": 4.4,
    "mrp": 699,
    "price": 437,
    "pages": 368,
    "summary": "Matthew Walker reveals the science behind sleep and why it is essential for memory, immunity, mood, and longevity. He explores how modern lifestyles disrupt sleep and the dangers that follow. The book offers practical advice for improving sleep quality and protecting long-term health. A compelling call to treat sleep as a biological necessity, not a luxury."
  },
  {
    "title": "Into Thin Air",
    "author": ["Jon Krakauer"],
    "publishedYear": 1997,
    "category": "Non-Fiction",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/4/46/Into_Thin_Air.jpg",
    "rating": 4.3,
    "mrp": 569,
    "price": 430,
    "pages": 336,
    "summary": "Jon Krakauer recounts his harrowing experience during the 1996 Everest disaster, where a sudden storm turned an expedition deadly. Blending personal narrative with investigative detail, he examines the commercial pressures and human errors that contributed to the tragedy. The story captures both the allure and the peril of extreme mountaineering. A gripping and sobering adventure tale."
  },

  {
    "title": "The Lean Startup",
    "author": ["Eric Ries"],
    "publishedYear": 2011,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/1/11/Lean_Startup.png",
    "rating": 4.2,
    "mrp": 899,
    "price": 554,
    "pages": 320,
    "summary": "Eric Ries introduces a scientific approach to creating and scaling startups through rapid experimentation and customer feedback. He explains concepts like MVPs, validated learning, and iterative development. The framework helps entrepreneurs avoid waste and make smarter decisions under uncertainty. A foundational guide for modern innovators."
  },
  {
    "title": "Good to Great",
    "author": ["Jim Collins"],
    "publishedYear": 2001,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/0/03/Cover_Good_2_Gr8.jpg",
    "rating": 4.3,
    "mrp": 599,
    "price": 295,
    "pages": 304,
    "summary": "Jim Collins studies companies that achieved long-term greatness and uncovers the traits that set them apart. He highlights disciplined leadership, strategic focus, and a culture of accountability. Backed by extensive research, the book offers actionable insights on building enduring organizations. A business classic on sustainable performance."
  },
  {
    "title": "Rich Dad Poor Dad",
    "author": ["Robert Kiyosaki"],
    "publishedYear": 1997,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/b/b9/Rich_Dad_Poor_Dad.jpg",
    "rating": 4.0,
    "mrp": 999,
    "price": 299,
    "pages": 336,
    "summary": "A personal finance classic that teaches the mindset of financial independence and smart investing. Robert Kiyosaki contrasts the financial philosophies of his “rich dad” and “poor dad,” offering lessons on wealth, investing, and mindset. He emphasizes financial literacy, asset building, and escaping the rat race. The book challenges traditional views on education and employment. An influential guide to thinking differently about money."
  },
  {
    "title": "Made to Stick",
    "author": ["Chip Heath", "Dan Heath"],
    "publishedYear": 2007,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/c/cc/Madetostick-book.JPG",
    "rating": 4.2,
    "mrp": 699,
    "price": 437,
    "pages": 336,
    "summary": "Chip and Dan Heath explain why certain ideas are memorable and others are forgotten, using their SUCCESs framework—Simple, Unexpected, Concrete, Credible, Emotional, Stories. With entertaining examples, they show how to craft messages that resonate. The book is widely used in marketing, education, and communication. A practical guide to making ideas “stick.” "
  },
  {
    "title": "The Psychology of Money",
    "author": ["Morgan Housel"],
    "publishedYear": 2020,
    "category": "Business & Finance",
    "imageUrl": "https://5.imimg.com/data5/SELLER/Default/2022/2/GT/II/PM/147304712/whatsapp-image-2022-02-20-at-5-05-39-pm-1000x1000.jpeg",
    "rating": 4.6,
    "mrp": 399,
    "price": 290,
    "pages": 256,
    "summary": "Morgan Housel illustrates how human behavior influences financial decisions more than intelligence or strategy. Through simple stories and insights, he highlights the roles of luck, patience, fear, and long-term thinking. The book encourages humility and emotional awareness in managing money. A refreshing and accessible approach to personal finance."
  },
  {
    "title": "Zero to One",
    "author": ["Peter Thiel", "Blake Masters"],
    "publishedYear": 2014,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/d3/Zero_to_One.jpg",
    "rating": 4.1,
    "mrp": 599,
    "price": 422,
    "pages": 224,
    "summary": "Peter Thiel argues that true innovation creates something entirely new rather than competing within existing markets. He emphasizes building monopolies, thinking independently, and focusing on long-term value. The book blends philosophy with pragmatic startup advice. A bold blueprint for ambitious founders."
  },
  {
    "title": "The Intelligent Investor",
    "author": ["Benjamin Graham"],
    "publishedYear": 1949,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/5/57/Theintelligentinvestor.jpg",
    "rating": 4.4,
    "mrp": 799,
    "price": 488,
    "pages": 640,
    "summary": "Benjamin Graham’s classic teaches the principles of value investing, focusing on margin of safety, intrinsic value, and long-term discipline. He emphasizes protecting against market volatility and emotional decision-making. The book remains a cornerstone of serious investment education. Warren Buffett credits it as his greatest influence."
  },
  {
    "title": "Think and Grow Rich",
    "author": ["Napoleon Hill"],
    "publishedYear": 1937,
    "category": "Business & Finance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/e/e9/Think_and_grow_rich_original_cover.jpg",
    "rating": 4.0,
    "mrp": 199,
    "price": 125,
    "pages": 238,
    "summary": "Napoleon Hill distills lessons from interviews with successful achievers, emphasizing the power of desire, mindset, and persistence. He introduces concepts like autosuggestion, organized planning, and the mastermind group. The book inspires readers to control their thoughts to shape their destiny. A timeless motivational classic."
  },

  {
    "title": "Born a Crime",
    "author": ["Trevor Noah"],
    "publishedYear": 2016,
    "category": "Biography",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/f/fd/Born_a_Crime_by_Trevor_Noah_%28book_cover%29.jpg",
    "rating": 4.7,
    "mrp": 499,
    "price": 335,
    "pages": 304,
    "summary": "Trevor Noah recounts his childhood in apartheid and post-apartheid South Africa, where his mixed-race identity was literally illegal. His stories blend humor with poignant reflections on family, poverty, and resilience. Through vivid storytelling, he portrays the absurdities of racism and the strength of his mother’s influence. A heartfelt, funny, and powerful memoir."
  },
  {
    "title": "Steve Jobs",
    "author": ["Walter Isaacson"],
    "publishedYear": 2011,
    "category": "Biography",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/e/e4/Steve_Jobs_by_Walter_Isaacson.jpg",
    "rating": 4.5,
    "mrp": 699,
    "price": 524,
    "pages": 656,
    "summary": "A definitive biography revealing Jobs’ visionary brilliance, volatile personality, and world-changing innovations. Walter Isaacson delivers a candid and comprehensive biography based on extensive interviews with Jobs, his colleagues, and family. It reveals his visionary leadership, obsessive perfectionism, and difficult personality. The narrative traces the creation of iconic products that transformed technology. A fascinating portrait of genius and ambition."
  },
  {
    "title": "Long Walk to Freedom",
    "author": ["Nelson Mandela"],
    "publishedYear": 1994,
    "category": "Biography",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/7/74/Long_Walk_to_Freedom.jpg",
    "rating": 4.6,
    "mrp": 799,
    "price": 459,
    "pages": 656,
    "summary": "Mandela’s powerful autobiography chronicling his early life, activism, imprisonment, and path to presidency. Nelson Mandela’s autobiography traces his journey from rural childhood to revolutionary activism, 27 years of imprisonment, and eventual presidency. He reflects on the struggle against apartheid with remarkable dignity and humility. The book highlights courage, forgiveness, and the price of justice. A monumental account of one of history’s greatest leaders."
  },
  {
    "title": "The Diary of a Young Girl",
    "author": ["Anne Frank"],
    "publishedYear": 1947,
    "category": "Biography",
    "imageUrl": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1560816565i/48855.jpg",
    "rating": 4.6,
    "mrp": 199,
    "price": 129,
    "pages": 283,
    "summary": "Anne Frank’s profoundly moving diary documenting her life hiding from Nazi persecution. Anne Frank’s diary captures her emotional and intellectual growth while hiding from the Nazis in Amsterdam. She writes with honesty, humor, and insight about fear, hope, and daily life in confinement. Her voice becomes a symbol of innocence amid unimaginable tragedy. A timeless testament to the human spirit."
  },
  {
    "title": "Shoe Dog",
    "author": ["Phil Knight"],
    "publishedYear": 2016,
    "category": "Biography",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Shoe_dog_book_cover.jpg/500px-Shoe_dog_book_cover.jpg",
    "rating": 4.4,
    "mrp": 499,
    "price": 315,
    "pages": 400,
    "summary": "A candid memoir of Nike’s founder detailing his bold risks, failures, and path to building a global brand. Phil Knight recounts the early, chaotic years of building Nike from a small operation into a global powerhouse. The memoir reveals his struggles with debt, doubt, and competition, along with key partnerships that shaped the brand. Honest and vulnerable, the book shows entrepreneurship as a messy journey driven by passion. A rare inside look at creating an iconic company."
  },
  {
    "title": "When Breath Becomes Air",
    "author": ["Paul Kalanithi"],
    "publishedYear": 2016,
    "category": "Biography",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/dd/When_Breath_Becomes_Air.jpg",
    "rating": 4.5,
    "mrp": 684,
    "price": 384,
    "pages": 208,
    "summary": "Neurosurgeon Paul Kalanithi reflects on life, mortality, and purpose after being diagnosed with terminal cancer in his 30s. The memoir blends medical insight with philosophical depth as he confronts the transition from doctor to patient. It examines what makes a life meaningful even as it nears its end. A heartbreaking and inspiring meditation on living and dying."
  },
  {
    "title": "I Am Malala",
    "author": ["Malala Yousafzai"],
    "publishedYear": 2013,
    "category": "Biography",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/0/0d/I_Am_Malala.jpg",
    "rating": 4.6,
    "mrp": 499,
    "price": 361,
    "pages": 336,
    "summary": "Malala’s inspiring story of surviving a Taliban attack and becoming a global symbol for girls’ education. Malala Yousafzai recounts her fight for girls’ education in Pakistan, surviving a Taliban attack and rising to global prominence. She shares her family life, cultural identity, and unwavering commitment to justice. The book highlights resilience in the face of fear and oppression. A powerful story of courage and hope."
  },
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": ["J. K. Rowling"],
    "publishedYear": 1997,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/6/6b/Harry_Potter_and_the_Philosopher%27s_Stone_Book_Cover.jpg",
    "rating": 4.8,
    "mrp": 599,
    "price": 385,
    "pages": 223,
    "summary": "Harry discovers he is a wizard and begins his magical journey at Hogwarts School of Witchcraft and Wizardry. Harry discovers he is a wizard and enters the magical world of Hogwarts, where he finds friendship, adventure, and danger. As he uncovers mysteries about his past, he learns about courage, loyalty, and the battle between good and evil. The story blends wonder with emotional depth. A timeless beginning to a beloved series."
  },
  {
    "title": "The Hobbit",
    "author": ["J.R.R. Tolkien"],
    "publishedYear": 1937,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/4/4a/TheHobbit_FirstEdition.jpg",
    "rating": 4.7,
    "mrp": 399,
    "price": 317,
    "pages": 310,
    "summary": "Bilbo Baggins is swept into an unexpected adventure with a group of dwarves seeking to reclaim their homeland. Along the journey, he encounters trolls, goblins, and the creature Gollum, discovering bravery he never knew he possessed. The novel captures the charm of classic fantasy with humor and heart. A delightful prelude to The Lord of the Rings."
  },
  {
    "title": "The Lord of the Rings",
    "author": ["J.R.R. Tolkien"],
    "publishedYear": 1954,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/e/e9/First_Single_Volume_Edition_of_The_Lord_of_the_Rings.gif",
    "rating": 4.9,
    "mrp": 599,
    "price": 407,
    "pages": 1178,
    "summary": "An epic quest to destroy the One Ring and save Middle-earth from the rise of Sauron. An epic tale following Frodo Baggins as he undertakes the perilous mission to destroy the One Ring and defeat the dark lord Sauron. The story spans vast landscapes, deep friendships, and timeless battles between good and evil. Tolkien’s world-building is rich with myth, culture, and lore. A monumental masterpiece of fantasy literature."
  },
  {
    "title": "A Game of Thrones",
    "author": ["George R. R. Martin"],
    "publishedYear": 1996,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/93/AGameOfThrones.jpg",
    "rating": 4.7,
    "mrp": 699,
    "price": 466,
    "pages": 694,
    "summary": "In a realm of political intrigue and shifting alliances, great families battle for control of the Iron Throne. The story weaves together multiple perspectives, revealing betrayal, ambition, honor, and brutality. Magic and ancient threats return as winter approaches. A gritty, complex epic redefining modern fantasy."
  },
  {
    "title": "The Name of the Wind",
    "author": ["Patrick Rothfuss"],
    "publishedYear": 2007,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/5/56/TheNameoftheWind_cover.jpg",
    "rating": 4.6,
    "mrp": 699,
    "price": 477,
    "pages": 662,
    "summary": "Kvothe, a gifted young man, recounts his journey from orphaned street performer to legendary magician. Through hardship, study, and discovery, he chases truth about the mysterious Chandrian. The narrative blends music, magic, and myth with poetic storytelling. A deeply immersive and character-driven fantasy."
  },
  {
    "title": "Mistborn: The Final Empire",
    "author": ["Brandon Sanderson"],
    "publishedYear": 2006,
    "category": "Fantasy",
    "imageUrl": "https://m.media-amazon.com/images/I/51gvL3VMb4L._SY445_SX342_FMwebp_.jpg",
    "rating": 4.5,
    "mrp": 699,
    "price": 562,
    "pages": 544,
    "summary": "A group of rebels with magical abilities attempt to overthrow a thousand-year tyrant in this inventive fantasy. In a world ruled by an immortal tyrant, ash falls from the sky and society is brutally oppressed. A street thief named Vin discovers she is a rare Allomancer, capable of powerful metal-based magic. Recruited by rebels, she joins a bold plan to overthrow the seemingly invincible Lord Ruler. The story blends heist elements, deep lore, and surprising twists to create an unforgettable fantasy adventure."
  },
  {
    "title": "Percy Jackson & The Olympians: The Lightning Thief",
    "author": ["Rick Riordan"],
    "publishedYear": 2005,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/3/3b/The_Lightning_Thief_cover.jpg",
    "rating": 4.3,
    "mrp": 699,
    "price": 437,
    "pages": 377,
    "summary": "Percy discovers he is a demigod and is thrust into a world where ancient Greek gods and monsters still exist. Accused of stealing Zeus’s lightning bolt, he embarks on a quest across the United States to clear his name. Along the way, he forms lasting friendships and learns to embrace his identity. A fun, fast-paced fantasy filled with humor, action, and mythology."
  },
  {
    "title": "The Chronicles of Narnia",
    "author": ["C. S. Lewis"],
    "publishedYear": 1950,
    "category": "Fantasy",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/c/cb/The_Chronicles_of_Narnia_box_set_cover.jpg",
    "rating": 4.6,
    "mrp": 793,
    "price": 607,
    "pages": 767,
    "summary": "The classic series follows children who stumble into the magical world of Narnia, where animals speak and epic battles unfold. Guided by the noble lion Aslan, they face moral trials, temptations, and heroic quests. Each book explores themes of courage, faith, sacrifice, and redemption. A timeless blend of adventure and spiritual allegory."
  },

  {
    "title": "Thinking, Fast and Slow",
    "author": ["Daniel Kahneman"],
    "publishedYear": 2011,
    "category": "Psychology",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/c/c1/Thinking%2C_Fast_and_Slow.jpg",
    "rating": 4.5,
    "mrp": 799,
    "price": 399,
    "pages": 300,
    "summary": "Daniel Kahneman breaks down human decision-making into two systems: fast, intuitive thinking and slow, analytical thinking. Through decades of research, he reveals how biases and heuristics shape judgment in surprising ways. The book challenges our assumptions about rationality and offers tools for better reasoning. A landmark work in psychology and behavioral science."
  },
  {
    "title": "Grit",
    "author": ["Angela Duckworth"],
    "publishedYear": 2016,
    "category": "Psychology",
    "imageUrl": "https://m.media-amazon.com/images/I/71gPBwjsEfL._SL1500_.jpg",
    "rating": 4.1,
    "mrp": 699,
    "price": 490,
    "pages": 352,
    "summary": "Angela Duckworth argues that long-term success depends more on passion and perseverance than on raw talent. Using research and inspiring case studies, she explains how grit can be cultivated over time through consistency and purpose. The book encourages resilience in the face of setbacks. A motivating look at what truly drives achievement."
  },
  {
    "title": "The Power of Your Subconscious Mind",
    "author": ["Joseph Murphy"],
    "publishedYear": 1963,
    "category": "Psychology",
    "imageUrl": "https://m.media-amazon.com/images/I/81gTwYAhU7L._SL1500_.jpg",
    "rating": 4.2,
    "mrp": 199,
    "price": 149,
    "pages": 320,
    "summary": "Joseph Murphy explores how subconscious beliefs influence behavior, health, and success. He teaches techniques such as visualization and affirmations to reshape mental patterns. The book blends spiritual insight with practical psychology, encouraging readers to harness inner potential. A classic guide to transforming life through the mind."
  },
  {
    "title": "The Magic of Thinking Big",
    "author": ["David J. Schwartz"],
    "publishedYear": 1959,
    "category": "Psychology",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/93/TheMagicOfThinkingBig.jpg",
    "rating": 4.1,
    "mrp": 599,
    "price": 419,
    "pages": 320,
    "summary": "David J. Schwartz explains how mindset shapes ambition, confidence, and achievement. Through practical advice and motivating examples, he shows how thinking beyond limitations helps unlock opportunities. The book emphasizes action, belief, and goal-setting as foundations for success. A timeless motivational work encouraging big dreams."
  },
  {
    "title": "The Tipping Point",
    "author": ["Malcolm Gladwell"],
    "publishedYear": 2000,
    "category": "Psychology",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/7/73/Thetippingpoint.jpg",
    "rating": 4.0,
    "mrp": 399,
    "price": 264,
    "pages": 304,
    "summary": "Malcolm Gladwell explores how small actions can spark large-scale social change. He identifies key influencers—connectors, mavens, and salesmen—who help ideas spread like epidemics. Through real-world examples, he uncovers the dynamics behind trends, behavior shifts, and cultural movements. An engaging look at what causes ideas to “tip.”"
  },

  {
    "title": "Can't Hurt Me",
    "author": ["David Goggins"],
    "publishedYear": 2018,
    "category": "Self-Help",
    "imageUrl": "https://m.media-amazon.com/images/I/81YJFNc54lL._SL1500_.jpg",
    "rating": 4.6,
    "mrp": 499,
    "price": 145,
    "pages": 364,
    "summary": "David Goggins shares his brutal life journey—from abuse and poverty to becoming a Navy SEAL and ultramarathon runner. Through his “calloused mind” philosophy, he challenges readers to embrace discomfort and push beyond perceived limits. Raw, intense, and inspiring, the book blends memoir with mental toughness lessons. A manifesto for breaking barriers."
  },
  {
    "title": "Never Finished",
    "author": ["David Goggins"],
    "publishedYear": 2022,
    "category": "Self-Help",
    "imageUrl": "https://m.media-amazon.com/images/I/81Koim+CN3L._SL1500_.jpg",
    "rating": 4.5,
    "mrp": 499,
    "price": 216,
    "pages": 320,
    "summary": "A continuation of Goggins’ extreme mindset training, the book dives deeper into discipline, suffering, and relentless self-improvement. He recounts new challenges faced after fame, revealing his ongoing battle against complacency. Each chapter includes practical missions for readers to build resilience. A powerful reminder that growth never ends."
  },
  {
    "title": "Deep Work",
    "author": ["Cal Newport"],
    "publishedYear": 2016,
    "category": "Self-Help",
    "imageUrl": "https://m.media-amazon.com/images/I/71din4TLubL._SL1500_.jpg",
    "rating": 4.3,
    "mrp": 599,
    "price": 249,
    "pages": 304,
    "summary": "Cal Newport argues that deep, focused work is becoming increasingly rare yet is the key to mastering complex skills and producing high-value output. He outlines strategies for eliminating distraction and cultivating intense concentration. The book contrasts shallow tasks with meaningful productivity. A guide to thriving in an attention-fractured world."
  },
  {
    "title": "The 5 Second Rule",
    "author": ["Mel Robbins"],
    "publishedYear": 2017,
    "category": "Self-Help",
    "imageUrl": "https://m.media-amazon.com/images/I/81YnKBKVgdL._SL1500_.jpg",
    "rating": 4.0,
    "mrp": 999,
    "price": 549,
    "pages": 240,
    "summary": "Mel Robbins introduces a simple technique: count backward 5-4-3-2-1 and take immediate action. She shows how this rule interrupts hesitation, reduces anxiety, and builds confidence in daily decisions. Through personal stories and neuroscience insights, the book motivates readers to break inertia. A practical tool for behavior change."
  },

  {
    "title": "Ikigai",
    "author": ["Héctor García", "Francesc Miralles"],
    "publishedYear": 2016,
    "category": "Spirituality",
    "imageUrl": "https://m.media-amazon.com/images/I/71cRwWclCvL._SL1500_.jpg",
    "rating": 4.0,
    "mrp": 200,
    "price": 161,
    "pages": 208,
    "summary": "This book explores the Japanese concept of ikigai—your reason for living—through cultural wisdom, research, and observations from long-lived communities. It highlights balance, purpose, and simplicity as keys to happiness. The authors provide gentle guidance on finding meaning in everyday routines. A calming and inspiring read."
  },
  {
    "title": "The Power of Now",
    "author": ["Eckhart Tolle"],
    "publishedYear": 1997,
    "category": "Spirituality",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/6/66/TPON_Cover_LG.jpg",
    "rating": 4.3,
    "mrp": 599,
    "price": 299,
    "pages": 236,
    "summary": "Eckhart Tolle teaches the importance of living fully in the present moment to overcome stress, fear, and mental suffering. He explains how the ego traps us in past regrets and future worries. Through spiritual insights and practical meditation advice, the book guides readers toward inner peace. A transformative work on mindfulness and consciousness."
  },
  {
    "title": "The Four Agreements",
    "author": ["Don Miguel Ruiz"],
    "publishedYear": 1997,
    "category": "Spirituality",
    "imageUrl": "https://m.media-amazon.com/images/I/91h2OfS1MtL._SL1500_.jpg",
    "rating": 4.2,
    "mrp": 399,
    "price": 236,
    "pages": 160,
    "summary": "Drawing from Toltec wisdom, Don Miguel Ruiz outlines four principles—be impeccable with your word, don’t take anything personally, don’t make assumptions, and always do your best. Each agreement helps reduce emotional pain and improve relationships. The book encourages personal freedom and authenticity. A concise yet profound spiritual guide."
  },
  {
    "title": "Autobiography of a Yogi",
    "author": ["Paramahansa Yogananda"],
    "publishedYear": 1946,
    "category": "Spirituality",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Autobiography-of-a-Yogi.jpg",
    "rating": 4.5,
    "mrp": 279,
    "price": 149,
    "pages": 498,
    "summary": "Paramahansa Yogananda recounts his extraordinary life, his encounters with saints, and the spiritual traditions of India. The memoir introduces readers to yoga, meditation, and mystical experiences. It blends philosophy with personal narrative to inspire inner exploration. A foundational text for spiritual seekers worldwide."
  },

  {
    "title": "Pride and Prejudice",
    "author": ["Jane Austen"],
    "publishedYear": 1813,
    "category": "Romance",
    "imageUrl": "https://m.media-amazon.com/images/I/712P0p5cXIL._SL1400_.jpg",
    "rating": 4.6,
    "mrp": 299,
    "price": 149,
    "pages": 279,
    "summary": "Jane Austen’s beloved novel follows Elizabeth Bennet as she navigates family pressures, social expectations, and her evolving relationship with Mr. Darcy. Filled with wit and insight, it critiques class and first impressions. The story celebrates personal growth, integrity, and romantic tension. A timeless classic of love and manners."
  },
  {
    "title": "Me Before You",
    "author": ["Jojo Moyes"],
    "publishedYear": 2012,
    "category": "Romance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/e/e0/Me_Before_You.jpg",
    "rating": 4.1,
    "mrp": 599,
    "price": 367,
    "pages": 369,
    "summary": "Louisa Clark becomes a caregiver for Will Traynor, a man who lost his will to live after an accident. Their unlikely bond transforms both their lives as they confront questions of dignity, love, and freedom. Equal parts heartwarming and heartbreaking, the book explores sacrifice and emotional courage. A moving contemporary romance."
  },
  {
    "title": "The Notebook",
    "author": ["Nicholas Sparks"],
    "publishedYear": 1996,
    "category": "Romance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/8/86/Posternotebook.jpg",
    "rating": 4.0,
    "mrp": 499,
    "price": 388,
    "pages": 214,
    "summary": "Noah and Allie’s decades-spanning love story is marked by passion, separation, and enduring devotion. Through memories and journal entries, the novel examines the power of commitment and the fragility of aging. Nicholas Sparks weaves a tender tale of love that survives time and difficulty. A deeply emotional romantic classic."
  },
  {
    "title": "Eleanor & Park",
    "author": ["Rainbow Rowell"],
    "publishedYear": 2012,
    "category": "Romance",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/5/54/Eleanor_park_book_cover.jpg",
    "rating": 4.0,
    "mrp": 599,
    "price": 295,
    "pages": 328,
    "summary": "Two misfit teens form an unexpected bond through shared music, comics, and emotional vulnerability. The story tackles identity, bullying, and the complexities of first love. Rainbow Rowell captures the intensity and fragility of teenage emotions with tenderness. A poignant and heartfelt YA romance."
  }
]
